Repository: archisman-panigrahi/reco
Catalog: po/extra/*.po
Languages: es, it

source: Record talks to remember the contents later
es: Grabe charlas para recordar el contenido después
it: Registra i discorsi per ricordare i contenuti in seguito

source: An audio recording app that helps you recall things talked later.
es: Una aplicación de grabación de audio que le ayuda a evocar lo debatido posteriormente.
it: Un'app di registrazione audio che ti aiuta a ricordare le cose discusse.

source: Features include:
es: Algunas de las funcionalidades son:
it: Le caratteristiche includono:

source: Recording sounds from both your microphone and system at the same time. This would be useful when you record conversations with chat apps or stream videos on the Internet
es: Graba sonidos tanto del micrófono como del equipo a la vez. Esto resulta útil al momento de grabar conversaciones en aplicaciones de charla o si transmite vídeo en directo por Internet
it: Registrazione simultanea di suoni dal microfono e dal sistema. Questo sarebbe utile quando registri conversazioni con app di chat o in streaming video su Internet

source: Saving in some commonly used formats. It supports ALAC, FLAC, MP3, Ogg Vorbis, Opus, and WAV
it: Salva in alcuni formati di uso comune. Supporta ALAC, FLAC, MP3, Ogg Vorbis, Opus e WAV

source: Timed recording. You can set a delay before recording up to 15 seconds, and the length of recording up to 600 seconds
es: Grabación temporizada. Puede fijar un retardo antes de grabar de hasta 15 segundos, y la duración de la grabación por hasta 600 segundos
it: Registrazione a tempo. Puoi impostare un ritardo prima della registrazione fino a 15 secondi, e la durata della registrazione fino a 600 secondi

source: Autosaving or always-ask-where-to-save workflow. You can select whether the app saves recordings automatically or you choose a destination each time on saving them
es: Flujo de trabajo de guardado automático o de siempre preguntar. Puede definir que la aplicación guarde las grabaciones automáticamente o puede elegir el destino cada vez
it: Flusso di lavoro con salvataggio automatico o chied sempre dove salvare. Puoi selezionare se vuoi che l'app salva automaticamente le registrazioni oppure scegli una destinazione ogni volta dove salvarli

source: Saving recording when the app quits. Even if you happen to quit the app while recording, the recording is saved automatically or the file chooser dialog is shown depends on your saving setting
it: Salva la registrazione quando l'app si chiude. Anche se ti capita di chiudere l'app durante la registrazione, la registrazione viene salvata automaticamente o la finestra di selezione file di dialogo viene visualizzata in base alle impostazioni di salvataggio

source: Welcome view; perform recording configuration
it: Vista di benvenuto; eseguire la configurazione della registrazione

source: Recording view
it: Vista di registrazione

source: An indication that recording is successfully finished
it: Un'indicazione che la registrazione è terminata con successo

source: Migrate to GTK 4, the latest version of GTK
it: Migrato a GTK 4, l'ultima versione di GTK

source: Get disk access permission only when the user allowed
it: Ottieni l'autorizzazione di accesso al disco solo quando l'utente è autorizzato

source: Hide remaining time label when unnecessary
it: Nascondi l'etichetta del tempo rimanente quando non necessario

source: Fix no style button selected on non-Pantheon desktop environments when first launch
it: Non corretto il pulsante di stile selezionato su ambienti desktop non Pantheon al primo avvio

source: Update translations
es: Traducciones actualizadas
it: Aggiornate le traduzioni

source: Update Flatpak runtime version
it: Aggiornato la versione runtime di Flatpak

source: Check desktop environment on runtime
it: Verifica l'ambiente desktop in fase di esecuzione

source: Show nicer message dialogs depending on the running desktop environment
it: Mostra finestre di dialogo dei messaggi più belle a seconda dell'ambiente desktop in esecuzione

source: Translation updates:
it: Aggiornamenti di traduzione:

source: Update French translation (thanks to @NathanBnm)
it: Aggiornata traduzione francese (grazie a @NathanBnm)

source: Update Portuguese translation (thanks to @hugok79)
it: Aggiornata la traduzione portoghese (grazie a @hugok79)

source: Update Dutch translation (thanks to @Vistaus)
es: Traducción al neerlandés actualizada (gracias a @Vistaus)
it: Aggiornata la traduzione olandese (grazie a @Vistaus)

source: Add simplified Chinese translation (thanks to @ShuiHuo)
it: Aggiungi una traduzione cinese semplificata (grazie a @ShuiHuo)

source: Reco is now available on Flathub too!
it: Reco è ora disponibile anche su Flathub!

source: Update Spanish translation (thanks to @Eldhrimer)
it: Aggiornata la traduzione spagnola (grazie a @Eldhrimer)

source: Update Italian translation (thanks to @albanobattistella)
it: Aggiornata traduzione Italiana (grazie a @albanobattistella)

source: Let's celebrate the new year with the issue from the ancient fixed!
it: Festeggiamo il nuovo anno con un problema sistemato dell'anno scorso!

source: Replace AAC option with ALAC to prevent strange stereo files being generated
it: Sostituisce l'opzione AAC con ALAC per evitare che vengano generati strani file stereo

source: The release for celebrating the 3rd anniversary of the app!
it: La release per celebrare il 3° anniversario dell'app!

source: Add new style switcher
it: Aggiunto un nuovo selettore di stile

source: Update Japanese translation
es: Traducción al japonés actualizada
it: Aggiornata la traduzione giapponese

source: Use the user cache folder instead of the system temporary folder to save temporary recording files
it: Utilizza la cartella della cache dell'utente invece della cartella temporanea di sistema per salvare file di registrazione temporanea

source: Fix wrong OARS data
it: Corretto dati OARS errati

source: Publish the app to the new AppCenter on elementary OS 6 with the Flatpak manifest
it: Pubblictoa l'app nel nuovo AppCenter su elementary OS 6 con manifesto Flatpak

source: A completely rewrited and improved method to detect recording sources
it: Un metodo completamente riscritto e migliorato per rilevare le sorgenti di registrazione

source: Redesign: Separate Delay and Duration settings from Recording section as Timer section and put it under Recording section
it: Riprogettazione: separato le impostazioni di ritardo e durata dalla sezione Registrazione come Sezione Timer e messo nella sezione Registrazione

source: Make sure to show a dialog for any errors in recording
it: Assicurati di mostrare una finestra di dialogo per eventuali errori nella registrazione

source: Code refactoring
it: Refactoring del codice

source: Add Brazilian Portuguese translation (thanks to @mathessaricci)
it: Aggiunto la traduzione in portoghese brasiliano (grazie a @mathessaricci)

source: Update Spanish translation and add Catalan translation (thanks to @fitojb)
it: Aggiornata la traduzione spagnola e aggiungi la traduzione catalana (grazie a @fitojb)

source: Revert another change done in version 2.4.3 that potentially caused an error during the packaging process
es: Se revierte otro cambio efectuado en la versión 2.4.3 que potencialmente causaba un error durante el proceso de empaquetamiento
it: Ripristina un'altra modifica apportata nella versione 2.4.3 che potenzialmente ha causato un errore durante il processo di packaging

source: Revive the change that had been reverted in version 2.4.4
es: Se revive el cambio que se había revertido en la versión 2.4.4
it: Rianima la modifica che è stata ripristinata nella versione 2.4.4

source: Revert changes done in version 2.4.3 that potentially caused an error during the packaging process
es: Se revierten los cambios efectuados en la versión 2.4.3 que podían provocar un error de empaquetamiento
it: Ripristina le modifiche apportate nella versione 2.4.3 che potenzialmente hanno causato un errore durante il processo di packaging

source: MainWindow: Readable copy for dialog messages
es: MainWindow: texto legible para los mensajes de los diálogos
it: Finestra principale: copia leggibile per i messaggi di dialogo

source: MainWindow: Add window title for the new Gala feature that shows windows titles in Multitasking view
es: MainWindow: se añade el título de la ventana para la función nueva de Gala que muestra los títulos en la vista multitareas
it: Finestra principale: aggiunto il titolo della finestra per la nuova funzione Gala che mostra i titoli delle finestre in visualizzazione multitasking

source: Add Italian translation (thanks to @albanobattistella)
es: Traducción al italiano añadida (gracias a @albanobattistella)
it: Aggiunta traduzione italiana (grazie a @albanobattistella)

source: Add Portuguese translation (thanks to @hugok79)
es: Traducción al portugués añadida (gracias a @hugok79)
it: Aggiunta la traduzione portoghese (grazie a @hugok79)

source: Clean code
es: Limpieza de código
it: Codice ripulito

source: Inhibit sleeping while recording
es: Se inhibe la suspensión durante las grabaciones
it: inibire lo sleep mode durante la registrazione

source: Make sure GSettings key "length" and "delay" take only natural numbers
es: Se asegura que las claves de GSettings «length» y «delay» solo reciban números naturales
it: Assicurati che la chiave GSettings "length" e "delay" prendano solo numeri naturali

source: Follow API change of Gtk.FileChooser in GTK 4
es: Se sigue una modificación de la API de Gtk.FileChooser en GTK 4
it: Segui la modifica dell'API di Gtk.FileChooser in GTK 4

source: Fix temporary recordings are not deleted on error
es: Se arregló un problema que causaba que no se eliminasen las grabaciones temporales
it: Le correzioni delle registrazioni temporanee non vengono eliminate in caso di errore

source: Fix some microphones are not recognized (thanks to @peteruithoven)
es: Se corrigió el reconocimiento de algunos micrófonos (gracias a @peteruithoven)
it: Risolto il problema con alcuni microfoni non riconosciuti (grazie a @peteruithoven)

source: Update Turkish translation (thanks to @safak45x)
es: Traducción al turco actualizada (por @safak45x)
it: Aggiornata la traduzione turca (grazie a @ safak45x)

source: Respect an elementary OS-wide dark preference
es: Se respeta la preferencia de tema oscuro global de elementary OS
it: Rispetta una preferenza scura di elementary OS a livello di sistema

source: Allow setting per-app dark style preference
es: Se permite definir la preferencia de estilo oscuro por aplicación
it: Consente l'impostazione della preferenza per lo stile scuro per app

source: Allow choosing stereo or mono
es: Se permite elegir entre monoaural o estéreo
it: Consente la scelta di stereo o mono

source: Update Spanish translation (thanks to @CCaroV)
es: Traducción al español actualizada (gracias a @CCaroV)
it: Aggiornata la traduzione spagnola (grazie a @CCaroV)

source: Explicit gstreamer1.0-libav as a dependency to fix a potential crash when trying to record in AAC
es: Se explicita la dependencia con gstreamer1.0-libav para corregir un posible cierre inesperado al tratar de grabar en AAC
it: Gstreamer1.0-libav come dipendenza per correggere un potenziale arresto anomalo quando si cerca di registrare in AAC

source: Add Turkish translation (by @safak45x)
es: Traducción al turco añadida (por @safak45x)
it: Aggiunta traduzione in turco (di @safak45x)

source: Add Russian translation (by @usmanovmax)
es: Traducción al ruso añadida (por @usmanovmax)
it: Aggiunta traduzione russa (di @usmanovmax)

source: Add Polish translation (by @michalzkosmosu)
es: Traducción al polaco añadida (por @michalzkosmosu)
it: Aggiunta traduzione polacca (di @michalzkosmosu)

source: Update French translation (by @NathanBnm)
es: Traducción al francés actualizada (por @NathanBnm)
it: Aggiornata traduzione francese (di @NathanBnm)

source: Fix the weird behavior of the countdown timer when pausing/canceling it (by andreasomaini)
es: Se arregló el comportamiento extraño del temporizador al ponerlo en pausa o cancelarlo (por @andreasomaini)
it: Corretto lo strano comportamento del timer per il conto alla rovescia quando lo metti in pausa/annulli (da andreasomaini)

source: Support recording sounds from both your microphone and PC at the same time
es: Admite grabar sonidos provenientes del micrófono y del PC al mismo tiempo
it: Supporta la registrazione simultanea di suoni dal microfono e dal PC

source: End the app safely if the encoder is not created successfully
es: Se finaliza la aplicación con seguridad en caso de que no pueda crearse correctamente el codificador
it: Terminare l'applicazione in modo sicuro se l'encoder non viene creato correttamente

source: Update the app description in the readme and AppCenter to be more tantalizing
es: Se actualiza la descripción de la aplicación en el archivo README y el Centro de aplicaciones para que sea más prometedora
it: Aggiorna la descrizione dell'app nel file Leggimi e AppCenter per essere più attraente

source: Remove unnecessary field code that marks the app handleable files
es: Se eliminó código de campo innecesario que marcaba los archivos que maneja la aplicación
it: Rimuove il codice di campo non necessario che contrassegna i file gestibili dall'app

source: Fix recording won't success when changing the file format
es: Se arregló el problema que no permitía grabar correctamente cuando se modificaba el tipo de archivo
it: Correzione della registrazione non riuscita quando si modifica il formato del file

source: Add Spanish translation (by fitojb)
es: Traducción al español añadida (por @fitojb)
it: Aggiunta traduzione in spagnolo (di fitojb)

source: Getting/setting window positions gets more efficient
es: La definición y la recuperación de las posiciones de las ventanas es más eficiente
it: Le impostazioni/l'ottenimento delle posizioni delle finestre sono diventate più efficiente

source: Fix the app does not resume the pause icon when you cancel recording while pausing it
es: Se arregló el problema de reanudación con el icono de pausa si entretanto se cancelaba la grabación
it: Corretto l'app che non ripristina l'icona di pausa quando annulli la registrazione durante messa in pausa

source: Fix the app shows the successful mark even if a recording is not saved correctly
es: Ya no se muestra la marca de éxito cuando fallaba el guardado de una grabación
it: Corretto l'app che mostra il segno di successo anche se una registrazione non veniva salvatacorrettamente

source: Save and restore values typed into the spin buttons
es: Se guardan y restauran los valores introducidos en los botones de número
it: Salva e ripristina i valori digitati nei pulsanti di selezione

source: Allow to cancel/pause countdown before recording
es: Se permite cancelar o poner en pausa la cuenta regresiva antes de grabar
it: Consente di annullare/mettere in pausa il conto alla rovescia prima della registrazione

source: Save recordings when the app window is destroyed
es: Se guardan las grabaciones cuando se cierra la ventana de la aplicación
it: Salva le registrazioni quando la finestra dell'app viene distrutta

source: Fix the app freezes on closing an error dialog
es: Se arregla el bloqueo causado al cerrar un diálogo de error
it: Corretto il blocco dell'app alla chiusura di una finestra di dialogo di errore

source: Allow to record system sound
es: Se permite grabar el sonido del sistema
it: Permette di registrare il suono del sistema

source: Fix the timer does not stop in accordance with the recording
es: Corrige que el temporizador no se detenía en armonía con la grabación
it: Corretto il timer non si fermava in base alla registrazione

source: Grammatically fixes in the app description (by imasaru)
es: Arreglos gramaticales en la descripción de la aplicación (por imasaru)
it: Correzioni grammaticali nella descrizione dell'app (di imasaru)

source: Fix the localized screenshots don't appear to AppCenter
es: Se arregló la visualización de las capturas de pantalla regionalizadas en el Centro de aplicaciones
it: Corretto gli screenshot localizzati che non venivano visualizzati in AppCenter

source: Provide localized screenshots to AppCenter (French, Japanese, Lithuanian and Dutch)
es: Se brindan capturas de pantalla regionalizadas para el Centro de aplicaciones (en francés, japonés, lituano y neerlandés)
it: Fornisce screenshot localizzati ad AppCenter (francese, giapponese, lituano e olandese)

source: Fix temporary recording files remain when quit the app while recording
es: Ya no permanecen archivos de grabación temporales cuando se cierra la aplicación durante una grabación
it: Corretto i file di registrazione temporanei che rimanevano quando si chiude l'app durante la registrazione

source: Use upper case for WAV
es: Se utilizan mayúsculas para «WAV»
it: Usa lettere maiuscole per WAV

source: Add Dutch translation (by Vistaus)
es: Traducción al neerlandés añadida (por @Vistaus)
it: Aggiunta traduzione olandese (di Vistaus)

source: Fix the app isn't listed in the "Sound &amp; Video" category in Applications Menu
es: La aplicación ahora figura correctamente en la categoría «Sonido y vídeo» del menú Aplicaciones
it: Corretto l'app che non era elencata in "Audio e amp; Video" categoria in Menu Applicazioni

source: Add a shortcut key to toggle recording
es: Se añade un atajo de teclado para conmutar la grabación
it: Aggiungi un tasto di scelta rapida per attivare/disattivare la registrazione

source: Fix the name of "Recordings" folder is not created in system language
es: El nombre de la carpeta «Grabaciones» se crea en el idioma del sistema
it: Corretto il nome della cartella "Registrazioni" non creata nella lingua di sistema

source: Notify success of recording with a check mark
es: Se notifica el éxito al grabar con un visto
it: Notifica la riuscita della registrazione con un segno di spunta

source: Allow to cancel/pause recording
es: Se permite cancelar o poner en pausa la grabación
it: Consente di annullare/mettere in pausa la registrazione

source: Show a confirmation dialog when trying to quit the app if a recording is in progress
es: Se muestra un cuadro de diálogo de confirmación al intentar salir de la aplicación mientras se esté realizando una grabación
it: Mostra una finestra di dialogo di conferma quando si tenta di chiudere l'app se è presente una registrazione in corso

source: Add Lithuanian translation (by welaq)
es: Traducción al lituano añadida (por @welaq)
it: Aggiunta traduzione in lituano (di welaq)

source: Save and restore settings
es: Guardado y restauración de las opciones
it: Salva e ripristina le impostazioni

source: Support both do-not-ask-where-to-save flow and ask-where-to-save flow
es: Se admiten flujos de trabajo de guardado automático y de solicitud de ubicación
it: Supporta sia il flusso non-chiedere-dove-salvare sia il flusso-domanda-dove-salvare

source: Organized UI
es: Interfaz de usuario organizada
it: UI migliorata

source: Some small bug fixes
es: Algunos arreglos de defectos menores
it: Alcune piccole correzioni di bug

source: Add French translation (by NathanBnm)
es: Traducción al francés añadida (por @NathanBnm)
it: Aggiunta traduzione francese (di NathanBnm)

source: Allow to set recording length
es: Se permite fijar la duración de la grabación
it: Consente di impostare la durata della registrazione

source: Fix the countdown is weird when recording more than twice
es: Se arregló el funcionamiento de la cuenta regresiva al grabar más de dos veces
it: Corretto il conto alla rovescia quando si registra più di due volte

source: Localization improvement
es: Mejoras de regionalización
it: Miglioramento della localizzazione

source: Support recording with AAC, FLAC, Ogg Vorbis, Opus and MP3 formats
es: Permite grabar en los formatos AAC, FLAC, Ogg Vorbis, Opus y MP3
it: Supporta la registrazione con i formati AAC, FLAC, Ogg Vorbis, Opus e MP3

source: Show a notification after recorded successfully
es: Se muestra una notificación tras grabar con éxito
it: Mostra una notifica dopo aver registrato con successo

source: Add Japanese translation
es: Traducción al japonés añadida
it: Aggiunta la traduzione giapponese

source: Initial release
es: Versión inicial
it: Versione iniziale

source: Audio Recording App
es: Aplicación para grabar audio
it: App di registrazione audio

source: Record;Audio;Sound;Voice;
es: Grabar;Audio;Sonido;Voz;
it: Registra;Audio;Suono;Voce;
