Repository: archisman-panigrahi/reco
Catalog: po/*.po
Languages: fi

source: Preferences
fi: Asetukset

source: Error while recording
fi: Virhe tallentaessa ääntä

source: There was an error while recording.
fi: Ääntä tallentaessa tapahtui virhe.

source: Recording from %s
fi: Äänitallenne %s

source: Failed to save recording
fi: Äänitallenteen tallentaminen epäonnistui

source: Save your recording
fi: Tallenna äänitallenteesi

source: Save
fi: Tallenna

source: Failed to start recording
fi: Äänitallentamisen aloittaminen epäonnistui

source: There was an error while starting recording.
fi: Äänitallenteen aloittaminen epäonnistui.

source: Style:
fi: Tyyli:

source: Light
fi: Vaalea

source: Dark
fi: Tumma

source: System
fi: Järjestelmä

source: Recording is ongoing
fi: Äänitallennus on meneillään

source: Cancel the countdown
fi: Peru laskenta

source: Pause the countdown
fi: Keskeytä laskenta

source: Resume the countdown
fi: Jatka laskentaa

source: Cancel recording
fi: Peru äänitallenne

source: Finish recording
fi: Viimeistele äänitallenne

source: Pause recording
fi: Keskeytä äänitallenne

source: Resume recording
fi: Jatka äänitallennetta

source: Source
fi: Lähde

source: Record from:
fi: Tallennuslähde:

source: Microphone
fi: Mikrofoni

source: Both
fi: Molemmat

source: Microphone:
fi: Mikrofoni:

source: Channels:
fi: Kanavat:

source: Timer
fi: Ajastin

source: Delay in seconds:
fi: Viive sekunneissa:

source: Length in seconds:
fi: Kesto sekunneissa:

source: Saving
fi: Tallennus

source: Format:
fi: Muoto:

source: Automatically save files:
fi: Tallenna tiedostot automaattisesti:

source: Choose a default destination
fi: Valitse oletussijainti

source: Start recording
fi: Aloita tallennus

source: Select destination…
fi: Valitse sijainti…

source: Select
fi: Valitse
